Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_octospi2.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32U5Gx_octospi2 equates.
 */

#pragma once

#include    <stdint.h>

// OCTOSPI2 address definitions
// ----------------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    DCR1;
    volatile    uint32_t    DCR2;
    volatile    uint32_t    DCR3;
    volatile    uint32_t    DCR4;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    SR;
    volatile    uint32_t    FCR;
    volatile    uint32_t    RESERVED2[6];
    volatile    uint32_t    DLR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    AR;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    DR;
    volatile    uint32_t    RESERVED5[11];
    volatile    uint32_t    PSMKR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    PSMAR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    PIR;
    volatile    uint32_t    RESERVED8[27];
    volatile    uint32_t    CCR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    TCR;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    IR;
    volatile    uint32_t    RESERVED11[3];
    volatile    uint32_t    ABR;
    volatile    uint32_t    RESERVED12[3];
    volatile    uint32_t    LPTR;
    volatile    uint32_t    RESERVED13[3];
    volatile    uint32_t    WPCCR;
    volatile    uint32_t    RESERVED14;
    volatile    uint32_t    WPTCR;
    volatile    uint32_t    RESERVED15;
    volatile    uint32_t    WPIR;
    volatile    uint32_t    RESERVED16[3];
    volatile    uint32_t    WPABR;
    volatile    uint32_t    RESERVED17[7];
    volatile    uint32_t    WCCR;
    volatile    uint32_t    RESERVED18;
    volatile    uint32_t    WTCR;
    volatile    uint32_t    RESERVED19;
    volatile    uint32_t    WIR;
    volatile    uint32_t    RESERVED20[3];
    volatile    uint32_t    WABR;
    volatile    uint32_t    RESERVED21[23];
    volatile    uint32_t    HLCR;
} OCTOSPI2_TypeDef;

#ifdef __cplusplus
#define OCTOSPI2_NS reinterpret_cast<OCTOSPI2_TypeDef *>(0x420D2400U)
#define OCTOSPI2_S  reinterpret_cast<OCTOSPI2_TypeDef *>(0x520D2400U)

#else
#define OCTOSPI2_NS ((OCTOSPI2_TypeDef *)0x420D2400U)
#define OCTOSPI2_S  ((OCTOSPI2_TypeDef *)0x520D2400U)
#endif

// CR Configuration

#define OCTOSPI2_CR_EN              (0x1U<<0U)
#define OCTOSPI2_CR_ABORT           (0x1U<<1U)
#define OCTOSPI2_CR_DMAEN           (0x1U<<2U)
#define OCTOSPI2_CR_TCEN            (0x1U<<3U)
#define OCTOSPI2_CR_DQM             (0x1U<<6U)
#define OCTOSPI2_CR_FSEL            (0x1U<<7U)
#define OCTOSPI2_CR_FTHRES          (0x1FU<<8U)
#define OCTOSPI2_CR_FTHRES_0        (0x1U<<8U)
#define OCTOSPI2_CR_TEIE            (0x1U<<16U)
#define OCTOSPI2_CR_TCIE            (0x1U<<17U)
#define OCTOSPI2_CR_FTIE            (0x1U<<18U)
#define OCTOSPI2_CR_SMIE            (0x1U<<19U)
#define OCTOSPI2_CR_TOIE            (0x1U<<20U)
#define OCTOSPI2_CR_APMS            (0x1U<<22U)
#define OCTOSPI2_CR_PMM             (0x1U<<23U)
#define OCTOSPI2_CR_FMODE           (0x3U<<28U)
#define OCTOSPI2_CR_FMODE_0         (0x1U<<28U)

// DCR1 Configuration

#define OCTOSPI2_DCR1_MTYP          (0x7U<<24U)
#define OCTOSPI2_DCR1_MTYP_0        (0x1U<<24U)
#define OCTOSPI2_DCR1_DEVSIZE       (0x1FU<<16U)
#define OCTOSPI2_DCR1_DEVSIZE_0     (0x1U<<16U)
#define OCTOSPI2_DCR1_CSHT          (0x3FU<<8U)
#define OCTOSPI2_DCR1_CSHT_0        (0x1U<<8U)
#define OCTOSPI2_DCR1_DLYBYP        (0x1U<<3U)
#define OCTOSPI2_DCR1_FRCK          (0x1U<<1U)
#define OCTOSPI2_DCR1_CKMODE        (0x1U<<0U)

// DCR2 Configuration

#define OCTOSPI2_DCR2_WRAPSIZE      (0x7U<<16U)
#define OCTOSPI2_DCR2_WRAPSIZE_0    (0x1U<<16U)
#define OCTOSPI2_DCR2_PRESCALER     (0xFFU<<0U)
#define OCTOSPI2_DCR2_PRESCALER_0   (0x1U<<0U)

// DCR3 Configuration

#define OCTOSPI2_DCR3_CSBOUND       (0x1FU<<16U)
#define OCTOSPI2_DCR3_CSBOUND_0     (0x1U<<16U)
#define OCTOSPI2_DCR3_MAXTRAN       (0xFFU<<0U)
#define OCTOSPI2_DCR3_MAXTRAN_0     (0x1U<<0U)

// DCR4 Configuration

#define OCTOSPI2_DCR4_REFRESH       (0xFFFFFFFFU<<0U)
#define OCTOSPI2_DCR4_REFRESH_0     (0x1U<<0U)

// SR Configuration

#define OCTOSPI2_SR_FLEVEL          (0x3FU<<8U)
#define OCTOSPI2_SR_FLEVEL_0        (0x1U<<8U)
#define OCTOSPI2_SR_BUSY            (0x1U<<5U)
#define OCTOSPI2_SR_TOF             (0x1U<<4U)
#define OCTOSPI2_SR_SMF             (0x1U<<3U)
#define OCTOSPI2_SR_FTF             (0x1U<<2U)
#define OCTOSPI2_SR_TCF             (0x1U<<1U)
#define OCTOSPI2_SR_TEF             (0x1U<<0U)

// FCR Configuration

#define OCTOSPI2_FCR_CTOF           (0x1U<<4U)
#define OCTOSPI2_FCR_CSMF           (0x1U<<3U)
#define OCTOSPI2_FCR_CTCF           (0x1U<<1U)
#define OCTOSPI2_FCR_CTEF           (0x1U<<0U)

// DLR Configuration

#define OCTOSPI2_DLR_DL             (0xFFFFFFFFU<<0U)
#define OCTOSPI2_DLR_DL_0           (0x1U<<0U)

// AR Configuration

#define OCTOSPI2_AR_ADDRESS         (0xFFFFFFFFU<<0U)
#define OCTOSPI2_AR_ADDRESS_0       (0x1U<<0U)

// DR Configuration

#define OCTOSPI2_DR_DATA            (0xFFFFFFFFU<<0U)
#define OCTOSPI2_DR_DATA_0          (0x1U<<0U)

// PSMKR Configuration

#define OCTOSPI2_PSMKR_MASK         (0xFFFFFFFFU<<0U)
#define OCTOSPI2_PSMKR_MASK_0       (0x1U<<0U)

// PSMAR Configuration

#define OCTOSPI2_PSMAR_MATCH        (0xFFFFFFFFU<<0U)
#define OCTOSPI2_PSMAR_MATCH_0      (0x1U<<0U)

// PIR Configuration

#define OCTOSPI2_PIR_INTERVAL       (0xFFFFU<<0U)
#define OCTOSPI2_PIR_INTERVAL_0     (0x1U<<0U)

// CCR Configuration

#define OCTOSPI2_CCR_SIOO           (0x1U<<31U)
#define OCTOSPI2_CCR_DQSE           (0x1U<<29U)
#define OCTOSPI2_CCR_DDTR           (0x1U<<27U)
#define OCTOSPI2_CCR_DMODE          (0x7U<<24U)
#define OCTOSPI2_CCR_DMODE_0        (0x1U<<24U)
#define OCTOSPI2_CCR_ABSIZE         (0x3U<<20U)
#define OCTOSPI2_CCR_ABSIZE_0       (0x1U<<20U)
#define OCTOSPI2_CCR_ABDTR          (0x1U<<19U)
#define OCTOSPI2_CCR_ABMODE         (0x7U<<16U)
#define OCTOSPI2_CCR_ABMODE_0       (0x1U<<16U)
#define OCTOSPI2_CCR_ADSIZE         (0x3U<<12U)
#define OCTOSPI2_CCR_ADSIZE_0       (0x1U<<12U)
#define OCTOSPI2_CCR_ADDTR          (0x1U<<11U)
#define OCTOSPI2_CCR_ADMODE         (0x7U<<8U)
#define OCTOSPI2_CCR_ADMODE_0       (0x1U<<8U)
#define OCTOSPI2_CCR_ISIZE          (0x3U<<4U)
#define OCTOSPI2_CCR_ISIZE_0        (0x1U<<4U)
#define OCTOSPI2_CCR_IDTR           (0x1U<<3U)
#define OCTOSPI2_CCR_IMODE          (0x7U<<0U)
#define OCTOSPI2_CCR_IMODE_0        (0x1U<<0U)

// TCR Configuration

#define OCTOSPI2_TCR_SSHIFT         (0x1U<<30U)
#define OCTOSPI2_TCR_DHQC           (0x1U<<28U)
#define OCTOSPI2_TCR_DCYC           (0x1FU<<0U)
#define OCTOSPI2_TCR_DCYC_0         (0x1U<<0U)

// IR Configuration

#define OCTOSPI2_IR_INSTRUCTION     (0xFFFFFFFFU<<0U)
#define OCTOSPI2_IR_INSTRUCTION_0   (0x1U<<0U)

// ABR Configuration

#define OCTOSPI2_ABR_ALTERNATE      (0xFFFFFFFFU<<0U)
#define OCTOSPI2_ABR_ALTERNATE_0    (0x1U<<0U)

// LPTR Configuration

#define OCTOSPI2_LPTR_TIMEOUT       (0xFFFFU<<0U)
#define OCTOSPI2_LPTR_TIMEOUT_0     (0x1U<<0U)

// WPCCR Configuration

#define OCTOSPI2_WPCCR_DQSE         (0x1U<<29U)
#define OCTOSPI2_WPCCR_DDTR         (0x1U<<27U)
#define OCTOSPI2_WPCCR_DMODE        (0x7U<<24U)
#define OCTOSPI2_WPCCR_DMODE_0      (0x1U<<24U)
#define OCTOSPI2_WPCCR_ABSIZE       (0x3U<<20U)
#define OCTOSPI2_WPCCR_ABSIZE_0     (0x1U<<20U)
#define OCTOSPI2_WPCCR_ABDTR        (0x1U<<19U)
#define OCTOSPI2_WPCCR_ABMODE       (0x7U<<16U)
#define OCTOSPI2_WPCCR_ABMODE_0     (0x1U<<16U)
#define OCTOSPI2_WPCCR_ADSIZE       (0x3U<<12U)
#define OCTOSPI2_WPCCR_ADSIZE_0     (0x1U<<12U)
#define OCTOSPI2_WPCCR_ADDTR        (0x1U<<11U)
#define OCTOSPI2_WPCCR_ADMODE       (0x7U<<8U)
#define OCTOSPI2_WPCCR_ADMODE_0     (0x1U<<8U)
#define OCTOSPI2_WPCCR_ISIZE        (0x3U<<4U)
#define OCTOSPI2_WPCCR_ISIZE_0      (0x1U<<4U)
#define OCTOSPI2_WPCCR_IDTR         (0x1U<<3U)
#define OCTOSPI2_WPCCR_IMODE        (0x7U<<0U)
#define OCTOSPI2_WPCCR_IMODE_0      (0x1U<<0U)

// WPTCR Configuration

#define OCTOSPI2_WPTCR_SSHIFT       (0x1U<<30U)
#define OCTOSPI2_WPTCR_DHQC         (0x1U<<28U)
#define OCTOSPI2_WPTCR_DCYC         (0x1FU<<0U)
#define OCTOSPI2_WPTCR_DCYC_0       (0x1U<<0U)

// WPIR Configuration

#define OCTOSPI2_WPIR_INSTRUCTION   (0xFFFFFFFFU<<0U)
#define OCTOSPI2_WPIR_INSTRUCTION_0 (0x1U<<0U)

// WPABR Configuration

#define OCTOSPI2_WPABR_ALTERNATE    (0xFFFFFFFFU<<0U)
#define OCTOSPI2_WPABR_ALTERNATE_0  (0x1U<<0U)

// WCCR Configuration

#define OCTOSPI2_WCCR_DQSE          (0x1U<<29U)
#define OCTOSPI2_WCCR_DDTR          (0x1U<<27U)
#define OCTOSPI2_WCCR_DMODE         (0x7U<<24U)
#define OCTOSPI2_WCCR_DMODE_0       (0x1U<<24U)
#define OCTOSPI2_WCCR_ABSIZE        (0x3U<<20U)
#define OCTOSPI2_WCCR_ABSIZE_0      (0x1U<<20U)
#define OCTOSPI2_WCCR_ABDTR         (0x1U<<19U)
#define OCTOSPI2_WCCR_ABMODE        (0x7U<<16U)
#define OCTOSPI2_WCCR_ABMODE_0      (0x1U<<16U)
#define OCTOSPI2_WCCR_ADSIZE        (0x3U<<12U)
#define OCTOSPI2_WCCR_ADSIZE_0      (0x1U<<12U)
#define OCTOSPI2_WCCR_ADDTR         (0x1U<<11U)
#define OCTOSPI2_WCCR_ADMODE        (0x7U<<8U)
#define OCTOSPI2_WCCR_ADMODE_0      (0x1U<<8U)
#define OCTOSPI2_WCCR_ISIZE         (0x3U<<4U)
#define OCTOSPI2_WCCR_ISIZE_0       (0x1U<<4U)
#define OCTOSPI2_WCCR_IDTR          (0x1U<<3U)
#define OCTOSPI2_WCCR_IMODE         (0x7U<<0U)
#define OCTOSPI2_WCCR_IMODE_0       (0x1U<<0U)

// WTCR Configuration

#define OCTOSPI2_WTCR_DCYC          (0x1FU<<0U)
#define OCTOSPI2_WTCR_DCYC_0        (0x1U<<0U)

// WIR Configuration

#define OCTOSPI2_WIR_INSTRUCTION    (0xFFFFFFFFU<<0U)
#define OCTOSPI2_WIR_INSTRUCTION_0  (0x1U<<0U)

// WABR Configuration

#define OCTOSPI2_WABR_ALTERNATE     (0xFFFFFFFFU<<0U)
#define OCTOSPI2_WABR_ALTERNATE_0   (0x1U<<0U)

// HLCR Configuration

#define OCTOSPI2_HLCR_TRWR          (0xFFU<<16U)
#define OCTOSPI2_HLCR_TRWR_0        (0x1U<<16U)
#define OCTOSPI2_HLCR_TACC          (0xFFU<<8U)
#define OCTOSPI2_HLCR_TACC_0        (0x1U<<8U)
#define OCTOSPI2_HLCR_WZL           (0x1U<<1U)
#define OCTOSPI2_HLCR_LM            (0x1U<<0U)
